'''
ให้รับเวลาเข้าและออกของรถให้รับเวลาเข้าและออกของรถคันหนึ่ง (เปิดบริการตั้งแต่ 7:00 - 23:00) จากนั้น
คํานวณค่าที่จอดรถที่ต้องจ่าย โดยหลักเกณฑ์การคํานวณมีดังนี้ 
    1) จอดรถไม่เกิน 15 นาที ไม่คิดค่าบริการ 
    2) จอดรถเกิน 15 นาที แต่ไม่เกิน 3 ชั่วโมง คิดค่าบริการชั่วโมงละ 10 บาท เศษของชั่วโมงคิดเป็น
หนึ่งชั่วโมง 
    3) จอดรถตั้งแต่ 4 ชั่วโมง ถึง 6 ชั่วโมง คิดค่าบริการชั่วโมงที่ 4-6 ชั่วโมงละ 20 บาท เศษของ
ชั่วโมงคิดเป็นหนึ่งชั่วโมง 
    4) จอดรถเกิน 6 ชั่วโมงขึ้นไป เหมาจ่ายวันละ 200 บาท 
ข้อมูลนําเข้า 
    มี 1 บรรทัด แต่ละบรรทัดมีจํานวนเต็ม 4 จํานวนคั่นด้วย Space 
    โดยบรรทัดที่ 1-2 เป็นชั่วโมงและนาทีของเวลาเข้า และบรรทัดที่ 3-4 เป็นชั่วโมงและนาทีของเวลาออก 
ข้อมูลส่งออก 
    มีบรรทัดเดียว เป็นค่าที่จอดรถที่ต้องจ่าย ให้แสดงผลลัพธ์เป็นจํานวนเต็ม 

Input       Output 
7 0 7 15    0 
7 0 7 16    10 
7 30 10 30  30 
7 30 10 31  50 
7 30 13 31  200
'''
import math
cost = 0
Time_List = [int(num) for num in input().split(" ", 3)]
Entrance = Time_List[0]*60 + Time_List[1]
Exit = Time_List[2]*60 + Time_List[3]
Time_Use_Min = Exit - Entrance
Time_Use_Hour = math.ceil((Exit-Entrance)/60)

if Time_Use_Min <= 15:
    cost = 0
if 15 < Time_Use_Min <= 180:
    cost = 10*Time_Use_Hour
if 4 <= Time_Use_Hour <= 6:
    cost = 30+20*(Time_Use_Hour-3)
if Time_Use_Hour > 6:
    cost = 200

print(cost)